Dvani-8688/Wireless-Emergency-Traffic-Signal-Priority-System/Stm32_Reciever_code.c
/* USER CODE BEGIN Header */ 
/** 
: main.c 
****************************************************************************** 
* @file           
* @brief          
* @attention      
: Full 4-Way Traffic Control with Priority Emergency Preemption. 
: **USART2 is Debug/Putty (PA2/PA3 @ 115200), USART1 is HC-12 Rx (PA9/PA10 @ 9600)** 
* NOTE: TIM2 must be configured in CubeMX for 1ms interrupt and its global interrupt enabled. 
* Priority is determined by the character at packet index 2 ('3' > '2'). 
****************************************************************************** 
* 
* Cycle Logic: 
* Default Sequence: Green -> Yellow (Clearing Lane) -> Red+Yellow (Next Lane Preparation) -> Next Green 
****************************************************************************** 
*/ 
/* USER CODE END Header */ 
/* Includes ------------------------------------------------------------------*/ 
#include "main.h" 
/* Private includes ----------------------------------------------------------*/ 
/* USER CODE BEGIN Includes */ 
#include <string.h> 
#include <stdio.h> 
#include <stdbool.h> 
#include <limits.h> 
#include "stm32f1xx_hal_tim.h" 
/* USER CODE END Includes */ 
/* Private typedef -----------------------------------------------------------*/ 
/* USER CODE BEGIN PTD */ 
// --- HC-12 Communication Definitions --- 
#define START_DELIMITER '$' 
#define STOP_DELIMITER  '\n' 
#define PACKET_SIZE     8 
// --- Traffic FSM Definitions --- 
typedef enum { 
STATE_DEFAULT_N, 
STATE_DEFAULT_E, 
STATE_DEFAULT_S, 
STATE_DEFAULT_W, 
STATE_DEFAULT_CLEAR,    // Current Lane Yellow 
STATE_DEFAULT_PREPARE,  // Next Lane Red + Yellow 
STATE_EMERGENCY_CLEAR_TO_RED, 
STATE_EMERGENCY_GREEN, 
STATE_EMERGENCY_YELLOW, 
STATE_EMERGENCY_RESTORE 
} TrafficState; 
// --- Emergency Request Queue --- 
typedef struct { 
char lane_id; 
char priority;          
// Holds the character from the packet ('3' or '2') 
uint32_t arrival_time; 
bool is_active; 
} EmergencyRequest; 
/* USER CODE END PTD */ 
/* Private define ------------------------------------------------------------*/ 
/* USER CODE BEGIN PD */ 
// --- Time Definitions (ms) --- 
#define DEFAULT_GREEN_TIME      8000 
#define DEFAULT_YELLOW_TIME     2000 
#define DEFAULT_ALL_RED_TIME    1000 // Time used for Red+Yellow warning 
#define EMERGENCY_PASS_TIME     10000 
// --- GPIO Definitions (Assumed PB0-PB11 for R,Y,G) --- 
#define N_RED_Port  GPIOB 
#define N_RED_Pin   GPIO_PIN_0 
#define N_YEL_Port  GPIOB 
#define N_YEL_Pin   GPIO_PIN_1 
#define N_GRN_Port  GPIOB 
#define N_GRN_Pin   GPIO_PIN_2 
#define E_RED_Port  GPIOB 
#define E_RED_Pin   GPIO_PIN_3 
#define E_YEL_Port  GPIOB 
#define E_YEL_Pin   GPIO_PIN_4 
#define E_GRN_Port  GPIOB 
#define E_GRN_Pin   GPIO_PIN_5 
#define S_RED_Port  GPIOB 
#define S_RED_Pin   GPIO_PIN_6 
#define S_YEL_Port  GPIOB 
#define S_YEL_Pin   GPIO_PIN_7 
#define S_GRN_Port  GPIOB 
#define S_GRN_Pin   GPIO_PIN_8 
#define W_RED_Port  GPIOB 
#define W_RED_Pin   GPIO_PIN_9 
#define W_YEL_Port  GPIOB 
#define W_YEL_Pin   GPIO_PIN_10 
#define W_GRN_Port  GPIOB 
#define W_GRN_Pin   GPIO_PIN_11 
/* USER CODE END PD */ 
/* Private macro -------------------------------------------------------------*/ 
/* USER CODE BEGIN PM */ 
/* USER CODE END PM */ 
/* Private variables ---------------------------------------------------------*/ 
UART_HandleTypeDef huart1; // USART1: HC-12 Rx 
UART_HandleTypeDef huart2; // USART2: Debug Tx 
TIM_HandleTypeDef htim2; // Timer 2 Handle 
/* USER CODE BEGIN PV */ 
// --- Communication Variables --- 
static volatile uint8_t RxData = 0; 
static uint8_t RxPacketBuffer[PACKET_SIZE]; 
static uint8_t RxIndex = 0; 
static bool ReceivingPacket = false; 
static volatile GPIO_PinState led_state = GPIO_PIN_RESET; 
// --- Traffic FSM Variables --- 
TrafficState current_state = STATE_DEFAULT_N; 
TrafficState last_default_state = STATE_DEFAULT_N; 
uint32_t state_start_time = 0; 
volatile uint32_t g_timer_ms = 0; // Global non-blocking time tick 
// --- Emergency Queue Variables --- 
EmergencyRequest emergency_queue[4] = {0}; 
char current_emergency_lane = '0'; // The lane currently active in emergency green 
/* USER CODE END PV */ 
/* Private function prototypes -----------------------------------------------*/ 
void SystemClock_Config(void); 
static void MX_GPIO_Init(void); 
static void MX_USART1_UART_Init(void); 
static void MX_USART2_UART_Init(void); 
void MX_TIM2_Init(void); 
// Traffic Control Prototypes 
static void AllRed(void); 
static void SetLane(char lane_id, GPIO_PinState R, GPIO_PinState Y, GPIO_PinState G); 
static void TrafficFSM(void); 
static void DebugTransmit(const char *msg); 
                    
 
// HC-12 Prototypes 
void Process_Emergency_Packet(uint8_t *packet); 
uint8_t HexToByte(uint8_t hex_char); 
uint8_t Calculate_Checksum(uint8_t type, uint8_t priority, uint8_t lane); 
static bool CheckAndEnqueueRequest(char lane_id, char priority); 
static char FindHighestPriorityRequest(void); 
 
/* USER CODE BEGIN PFP */ 
/* USER CODE END PFP */ 
 
/* Private user code ---------------------------------------------------------*/ 
/* USER CODE BEGIN 0 */ 
 
// --- UTILITY FUNCTIONS (INCLUDING TIMER CALLBACK) --- 
 
static bool TimeElapsed(uint32_t duration) 
{ 
    return (g_timer_ms - state_start_time) >= duration; 
} 
 
static void DebugTransmit(const char *msg) 
{ 
    HAL_UART_Transmit(&huart2, (uint8_t*)msg, strlen(msg), 100); 
} 
 
// TIM2 Interrupt Handler: The 1ms system tick 
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) 
{ 
    if (htim->Instance == TIM2) { 
        g_timer_ms++; 
    } 
} 
 
// --- CHECKSUM & PACKET HELPERS --- 
 
uint8_t HexToByte(uint8_t hex_char) 
{ 
    if (hex_char >= '0' && hex_char <= '9') return hex_char - '0'; 
    if (hex_char >= 'A' && hex_char <= 'F') return hex_char - 'A' + 10; 
    if (hex_char >= 'a' && hex_char <= 'f') return hex_char - 'a' + 10; 
    return 0; 
} 
 
uint8_t Calculate_Checksum(uint8_t type, uint8_t priority, uint8_t lane) 
{ 
    return (uint8_t)(type + priority + lane); 
} 
                    
 
static int GetQueueIndex(char lane_id) { 
    // Lanes '1' (N) through '4' (W) map to array indices 0 through 3 
    if (lane_id >= '1' && lane_id <= '4') return lane_id - '1'; 
    return -1; 
} 
 
