Dvani-8688/Wireless-Emergency-Traffic-Signal-Priority-System/Stm32_Reciever_code.c
static bool CheckAndEnqueueRequest(char lane_id, char priority) 
{ 
    int index = GetQueueIndex(lane_id); 
    if (index == -1) return false; 
 
    if (!emergency_queue[index].is_active) { 
        emergency_queue[index].lane_id = lane_id; 
        emergency_queue[index].priority = priority; 
        emergency_queue[index].arrival_time = g_timer_ms; 
        emergency_queue[index].is_active = true; 
 
        char dbg[50]; 
        snprintf(dbg, sizeof(dbg), "[QUEUE] NEW Request: Lane %c, Prio %c.\r\n", lane_id, priority); 
        DebugTransmit(dbg); 
        return true; 
    } 
 
    // Heartbeat: update arrival time (to keep the priority active) 
    emergency_queue[index].arrival_time = g_timer_ms; 
    return false; 
} 
 
/** 
 * @brief Finds the highest priority vehicle request using the packet's priority character. 
 * Priority is set by the ASCII value of the character: '3' (Ambulance) > '2' (Firetruck). 
 * Ties are broken by FCFS (oldest arrival_time). 
 */ 
static char FindHighestPriorityRequest(void) 
{ 
    char highest_lane = '0'; 
    char highest_priority = '0'; 
    uint32_t oldest_time = ULONG_MAX; 
 
    for (int i = 0; i < 4; i++) { 
        if (emergency_queue[i].is_active) { 
 
            // 1. Priority Check: If current request has higher ASCII priority character 
            if (emergency_queue[i].priority > highest_priority) { 
                highest_priority = emergency_queue[i].priority; 
                highest_lane = emergency_queue[i].lane_id; 
                oldest_time = emergency_queue[i].arrival_time; 
                    
            } 
 
            // 2. Tiebreaker (Same Priority Level): Use First Come First Serve (FCFS) 
            else if (emergency_queue[i].priority == highest_priority) { 
                if (emergency_queue[i].arrival_time < oldest_time) { 
                    oldest_time = emergency_queue[i].arrival_time; 
                    highest_lane = emergency_queue[i].lane_id; 
                } 
            } 
        } 
    } 
    return highest_lane; 
} 
 
 
// --- HC-12 PACKET PROCESSING --- 
 
void Process_Emergency_Packet(uint8_t *packet) 
{ 
    char debug_msg[100]; 
 
    // Packet indices: [0:$][1:Type][2:Prio][3:Lane][4:C1][5:C2][6:\r][7:\n] 
    uint8_t priority_char = packet[2]; // PRIORITY (e.g., '3' or '2') 
    uint8_t lane_id = packet[3];       // LANE ID (e.g., '1' through '4') 
 
    uint8_t received_checksum_char1 = packet[4]; 
    uint8_t received_checksum_char2 = packet[5]; 
    uint8_t reconstructed_checksum = (HexToByte(received_checksum_char1) << 4) | 
HexToByte(received_checksum_char2); 
    uint8_t expected_checksum = Calculate_Checksum(packet[1], priority_char, lane_id); 
 
    if (reconstructed_checksum != expected_checksum) { 
        snprintf(debug_msg, sizeof(debug_msg), "[ERROR] Checksum Mismatch! Exp: %02X, Got: %02X.\r\n", 
expected_checksum, reconstructed_checksum); 
        DebugTransmit(debug_msg); 
        return; 
    } 
 
    DebugTransmit("[VALID] Packet Received. Checking Preemption...\r\n"); 
 
    // Add the request to the queue using the priority character 
    CheckAndEnqueueRequest(lane_id, priority_char); 
 
    // Check if we need to switch to emergency mode 
    if (current_state < STATE_EMERGENCY_CLEAR_TO_RED) { 
        DebugTransmit("[STATE] Default sequence interrupted. Switching to EMERGENCY.\r\n"); 
        // Store the current state (which will be a default state, N, E, S, W, CLEAR, or PREPARE) 
        // If it was CLEAR or PREPARE, it means last_default_state already holds the last green lane. 
                    
        if (current_state == STATE_DEFAULT_N || current_state == STATE_DEFAULT_E || 
            current_state == STATE_DEFAULT_S || current_state == STATE_DEFAULT_W) { 
            last_default_state = current_state; 
        } 
 
        current_state = STATE_EMERGENCY_CLEAR_TO_RED; 
        state_start_time = g_timer_ms; 
    } else if (current_state == STATE_EMERGENCY_GREEN) { 
        // Check for preemption if a higher priority vehicle arrived 
        char winning_lane = FindHighestPriorityRequest(); 
        if (winning_lane != current_emergency_lane) { 
            DebugTransmit("[STATE] Higher Prio or New FCFS Winner arrived. Clearing current lane.\r\n"); 
            // Switch directly to ALL_RED to handle the new request immediately 
            current_state = STATE_EMERGENCY_CLEAR_TO_RED; 
            state_start_time = g_timer_ms; 
        } 
    } 
 
    // Toggle the PA5 LED (Success confirmation) 
    led_state = (led_state == GPIO_PIN_RESET) ? GPIO_PIN_SET : GPIO_PIN_RESET; 
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, led_state); 
} 
 
// --- TRAFFIC CONTROL & FSM FUNCTIONS --- 
 
static void AllRed(void) 
{ 
    HAL_GPIO_WritePin(N_RED_Port,N_RED_Pin,GPIO_PIN_SET); 
    HAL_GPIO_WritePin(N_YEL_Port,N_YEL_Pin,GPIO_PIN_RESET); 
    HAL_GPIO_WritePin(N_GRN_Port,N_GRN_Pin,GPIO_PIN_RESET); 
 
    HAL_GPIO_WritePin(E_RED_Port,E_RED_Pin,GPIO_PIN_SET); 
    HAL_GPIO_WritePin(E_YEL_Port,E_YEL_Pin,GPIO_PIN_RESET); 
    HAL_GPIO_WritePin(E_GRN_Port,E_GRN_Pin,GPIO_PIN_RESET); 
 
    HAL_GPIO_WritePin(S_RED_Port,S_RED_Pin,GPIO_PIN_SET); 
    HAL_GPIO_WritePin(S_YEL_Port,S_YEL_Pin,GPIO_PIN_RESET); 
    HAL_GPIO_WritePin(S_GRN_Port,S_GRN_Pin,GPIO_PIN_RESET); 
 
    HAL_GPIO_WritePin(W_RED_Port,W_RED_Pin,GPIO_PIN_SET); 
    HAL_GPIO_WritePin(W_YEL_Port,W_YEL_Pin,GPIO_PIN_RESET); 
    HAL_GPIO_WritePin(W_GRN_Port,W_GRN_Pin,GPIO_PIN_RESET); 
} 
 
static void SetLane(char lane_id, GPIO_PinState R, GPIO_PinState Y, GPIO_PinState G) 
{ 
    // Sets all lanes to RED first, then sets the target lane state. 
    AllRed(); 
                    
 
    GPIO_TypeDef* port; 
    uint16_t r_pin, y_pin, g_pin; 
 
    switch (lane_id) { 
        case '1': port = N_RED_Port; r_pin = N_RED_Pin; y_pin = N_YEL_Pin; g_pin = N_GRN_Pin; break; 
        case '2': port = E_RED_Port; r_pin = E_RED_Pin; y_pin = E_YEL_Pin; g_pin = E_GRN_Pin; break; 
        case '3': port = S_RED_Port; r_pin = S_RED_Pin; y_pin = S_YEL_Pin; g_pin = S_GRN_Pin; break; 
        case '4': port = W_RED_Port; r_pin = W_RED_Pin; y_pin = W_YEL_Pin; g_pin = W_GRN_Pin; break; 
        default: return; 
    } 
 
    HAL_GPIO_WritePin(port, r_pin, R); 
    HAL_GPIO_WritePin(port, y_pin, Y); 
    HAL_GPIO_WritePin(port, g_pin, G); 
 
    char dbg[30]; 
    snprintf(dbg, sizeof(dbg), "[TRAF] Lane %c -> R%d Y%d G%d\r\n", lane_id, R, Y, G); 
    DebugTransmit(dbg); 
} 
 
// The core non-blocking logic loop 
static void TrafficFSM(void) 
{ 
    switch (current_state) { 
        // ------------------ DEFAULT SEQUENCE ------------------ 
        case STATE_DEFAULT_N: 
            SetLane('1', GPIO_PIN_RESET, GPIO_PIN_RESET, GPIO_PIN_SET); // N Green 
            if (TimeElapsed(DEFAULT_GREEN_TIME)) { 
                current_state = STATE_DEFAULT_CLEAR; 
                last_default_state = STATE_DEFAULT_N; 
                state_start_time = g_timer_ms; 
            } 
            break; 
 
        case STATE_DEFAULT_E: 
            SetLane('2', GPIO_PIN_RESET, GPIO_PIN_RESET, GPIO_PIN_SET); // E Green 
            if (TimeElapsed(DEFAULT_GREEN_TIME)) { 
                current_state = STATE_DEFAULT_CLEAR; 
                last_default_state = STATE_DEFAULT_E; 
                state_start_time = g_timer_ms; 
            } 
            break; 
 
        case STATE_DEFAULT_S: 
            SetLane('3', GPIO_PIN_RESET, GPIO_PIN_RESET, GPIO_PIN_SET); // S Green 
            if (TimeElapsed(DEFAULT_GREEN_TIME)) { 
                current_state = STATE_DEFAULT_CLEAR; 
                    
                last_default_state = STATE_DEFAULT_S; 
                state_start_time = g_timer_ms; 
            } 
            break; 
 
        case STATE_DEFAULT_W: 
            SetLane('4', GPIO_PIN_RESET, GPIO_PIN_RESET, GPIO_PIN_SET); // W Green 
            if (TimeElapsed(DEFAULT_GREEN_TIME)) { 
                current_state = STATE_DEFAULT_CLEAR; 
                last_default_state = STATE_DEFAULT_W; 
                state_start_time = g_timer_ms; 
            } 
            break; 
 
        case STATE_DEFAULT_CLEAR: 
            // 1. Set clearing lane to YELLOW (e.g., N Yellow) 
            if (last_default_state == STATE_DEFAULT_N) { 
                 SetLane('1', GPIO_PIN_RESET, GPIO_PIN_SET, GPIO_PIN_RESET); 
            } else if (last_default_state == STATE_DEFAULT_E) { 
                 SetLane('2', GPIO_PIN_RESET, GPIO_PIN_SET, GPIO_PIN_RESET); 
            } else if (last_default_state == STATE_DEFAULT_S) { 
                 SetLane('3', GPIO_PIN_RESET, GPIO_PIN_SET, GPIO_PIN_RESET); 
            } else if (last_default_state == STATE_DEFAULT_W) { 
                 SetLane('4', GPIO_PIN_RESET, GPIO_PIN_SET, GPIO_PIN_RESET); 
            } 
 
            // 2. Wait for Yellow time, then transition to the PREPARE state (R+Y) 
            if (TimeElapsed(DEFAULT_YELLOW_TIME)) { 
                current_state = STATE_DEFAULT_PREPARE; 
                state_start_time = g_timer_ms; 
            } 
            break; 
 
        case STATE_DEFAULT_PREPARE: // Red + Yellow warning state 
            // 1. Determine the NEXT default state (N->E->S->W->N) 
            TrafficState next_state = (last_default_state == STATE_DEFAULT_W) ? STATE_DEFAULT_N : 
(TrafficState)(last_default_state + 1); 
            char next_lane_id = '0'; 
 
            // Convert the next state enum back to a lane ID character 
            if (next_state == STATE_DEFAULT_N) next_lane_id = '1'; 
            else if (next_state == STATE_DEFAULT_E) next_lane_id = '2'; 
            else if (next_state == STATE_DEFAULT_S) next_lane_id = '3'; 
            else if (next_state == STATE_DEFAULT_W) next_lane_id = '4'; 
 
