Dvani-8688/Wireless-Emergency-Traffic-Signal-Priority-System/Stm32_Reciever_code.c
            // 2. Set the Next Lane to RED+YELLOW (Red ON, Yellow ON, Green OFF) 
            // Note: SetLane() calls AllRed() first, ensuring all other lanes are safe Red. 
            if (next_lane_id != '0') { 
                    
                 SetLane(next_lane_id, GPIO_PIN_SET, GPIO_PIN_SET, GPIO_PIN_RESET); 
                 DebugTransmit("[STATE] Preparing Next Lane (R+Y).\r\n"); 
            } else { 
                 AllRed(); // Safety fallback 
            } 
 
            // 3. Wait for the All Red/Preparation Time 
            if (TimeElapsed(DEFAULT_ALL_RED_TIME)) { 
                current_state = next_state; // Transition to the next lane's Green state 
                state_start_time = g_timer_ms; 
            } 
            break; 
 
        // ------------------ EMERGENCY PREEMPTION ------------------ 
        case STATE_EMERGENCY_CLEAR_TO_RED: 
            AllRed(); // Safety step: force all to RED 
            char winning_lane_check = FindHighestPriorityRequest(); 
 
            if (winning_lane_check == '0') { 
                // Queue is empty -> Restore default cycle 
                if (TimeElapsed(DEFAULT_ALL_RED_TIME)) { 
                    current_state = STATE_EMERGENCY_RESTORE; 
                    state_start_time = g_timer_ms; 
                    DebugTransmit("[STATE] Emergency queue empty. Restoring default cycle.\r\n"); 
                } 
            } 
            // Wait for safe ALL_RED time, then proceed to emergency green for the new winner 
            else if (TimeElapsed(DEFAULT_ALL_RED_TIME)) { 
                current_emergency_lane = winning_lane_check; // Set the new winner 
                current_state = STATE_EMERGENCY_GREEN; 
                state_start_time = g_timer_ms; 
                DebugTransmit("[STATE] Next Emergency vehicle found. Proceeding to Green.\r\n"); 
            } 
            break; 
 
 
        case STATE_EMERGENCY_GREEN: 
            // Set the winning lane green 
            SetLane(current_emergency_lane, GPIO_PIN_RESET, GPIO_PIN_RESET, GPIO_PIN_SET); 
 
            // Check if the pass time has elapsed 
            if (TimeElapsed(EMERGENCY_PASS_TIME)) { 
                // Vehicle pass time complete. Transition to YELLOW. 
                current_state = STATE_EMERGENCY_YELLOW; 
                state_start_time = g_timer_ms; 
                DebugTransmit("[STATE] Emergency pass time complete. Switching to YELLOW.\r\n"); 
            } 
            break; 
                    
 
        case STATE_EMERGENCY_YELLOW: 
            // The lane that was just emergency green turns YELLOW 
            SetLane(current_emergency_lane, GPIO_PIN_RESET, GPIO_PIN_SET, GPIO_PIN_RESET); 
 
            if (TimeElapsed(DEFAULT_YELLOW_TIME)) { 
                // Wait for Yellow time, then transition to All-Red, and remove the completed request 
                int index = GetQueueIndex(current_emergency_lane); 
                if (index != -1) { 
                    emergency_queue[index].is_active = false; // Deactivate the request 
                } 
 
                current_state = STATE_EMERGENCY_CLEAR_TO_RED; 
                state_start_time = g_timer_ms; 
                DebugTransmit("[STATE] Emergency Yellow complete. Checking queue status.\r\n"); 
            } 
            break; 
 
 
        case STATE_EMERGENCY_RESTORE: 
            AllRed(); 
            if (TimeElapsed(DEFAULT_ALL_RED_TIME)) { 
                // Resume where we left off, going to the PREPARE state to set up the R+Y for the next expected default 
lane 
                current_state = STATE_DEFAULT_PREPARE; 
                state_start_time = g_timer_ms; 
                DebugTransmit("[STATE] Resuming default sequence via PREPARE state.\r\n"); 
            } 
            break; 
    } 
} 
 
 
/* USER CODE END 0 */ 
 
/** 
  * @brief  The application entry point. 
  * @retval int 
  */ 
int main(void) 
{ 
    HAL_Init(); 
    SystemClock_Config(); 
 
    MX_GPIO_Init(); 
    MX_USART1_UART_Init(); 
    MX_USART2_UART_Init(); 
    MX_TIM2_Init(); 
                    
 
    HAL_TIM_Base_Start_IT(&htim2); 
 
    /* USER CODE BEGIN 2 */ 
    HAL_UART_Receive_IT(&huart1, (uint8_t*)&RxData, 1); 
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET); 
    DebugTransmit("STM32 System Init: Ready. Starting Default Traffic.\r\n"); 
    state_start_time = g_timer_ms; 
    /* USER CODE END 2 */ 
 
    /* Infinite loop: Runs the Non-Blocking State Machine */ 
    while (1) 
    { 
        TrafficFSM(); 
    } 
} 
 
 
// --- BOILERPLATE FUNCTIONS (Required for compilation) --- 
 
void SystemClock_Config(void) 
{ 
    RCC_OscInitTypeDef RCC_OscInitStruct = {0}; 
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0}; 
 
    // Assumed standard 72MHz clock setup 
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE; 
    RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS; 
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1; 
    RCC_OscInitStruct.HSIState = RCC_HSI_ON; 
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON; 
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE; 
    RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9; 
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK) { Error_Handler(); } 
 
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK 
                                |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2; 
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK; 
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1; 
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2; 
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1; 
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2)!= HAL_OK) { Error_Handler(); } 
} 
 
/** 
  * @brief TIM2 Initialization: Configured for 1ms interrupt 
  */ 
void MX_TIM2_Init(void) 
                    
{ 
  TIM_ClockConfigTypeDef sClockSourceConfig = {0}; 
  TIM_MasterConfigTypeDef sMasterConfig = {0}; 
 
