Dvani-8688/Wireless-Emergency-Traffic-Signal-Priority-System/Stm32_Reciever_code.c
  htim2.Instance = TIM2; 
  // Setting Prescaler for 72MHz clock to achieve 1MHz (72,000,000 / (71+1)) 
  htim2.Init.Prescaler = 71; 
  htim2.Init.CounterMode = TIM_COUNTERMODE_UP; 
  // Setting Period for 1MHz clock to achieve 1ms (1,000,000 / (999+1)) 
  htim2.Init.Period = 999; 
  htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1; 
  htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE; 
  if (HAL_TIM_Base_Init(&htim2) != HAL_OK) 
  { 
    Error_Handler(); 
  } 
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL; 
  if (HAL_TIM_ConfigClockSource(&htim2, &sClockSourceConfig) != HAL_OK) 
  { 
    Error_Handler(); 
  } 
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET; 
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE; 
  if (HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMasterConfig) != HAL_OK) 
  { 
    Error_Handler(); 
  } 
} 
 
/** 
  * @brief USART1 Initialization Function (HC-12 Data Link @ 9600 Baud) 
  */ 
static void MX_USART1_UART_Init(void) 
{ 
    huart1.Instance = USART1; 
    huart1.Init.BaudRate = 9600; 
    huart1.Init.WordLength = UART_WORDLENGTH_8B; 
    huart1.Init.StopBits = UART_STOPBITS_1; 
    huart1.Init.Parity = UART_PARITY_NONE; 
    huart1.Init.Mode = UART_MODE_TX_RX; 
    huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE; 
    huart1.Init.OverSampling = UART_OVERSAMPLING_16; 
    if (HAL_UART_Init(&huart1)!= HAL_OK) { Error_Handler(); } 
} 
 
/** 
  * @brief USART2 Initialization Function (Debug/Putty @ 115200 Baud) 
  */ 
                    
static void MX_USART2_UART_Init(void) 
{ 
    huart2.Instance = USART2; 
    huart2.Init.BaudRate = 115200; 
    huart2.Init.WordLength = UART_WORDLENGTH_8B; 
    huart2.Init.StopBits = UART_STOPBITS_1; 
    huart2.Init.Parity = UART_PARITY_NONE; 
    huart2.Init.Mode = UART_MODE_TX_RX; 
    huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE; 
    huart2.Init.OverSampling = UART_OVERSAMPLING_16; 
    if (HAL_UART_Init(&huart2)!= HAL_OK) { Error_Handler(); } 
} 
 
/** 
  * @brief GPIO Initialization Function 
  */ 
static void MX_GPIO_Init(void) 
{ 
    GPIO_InitTypeDef GPIO_InitStruct = {0}; 
 
    __HAL_RCC_GPIOD_CLK_ENABLE(); 
    __HAL_RCC_GPIOA_CLK_ENABLE(); 
    __HAL_RCC_GPIOB_CLK_ENABLE(); 
 
    // 1. LED Pin Initialization (PA5) 
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET); 
    GPIO_InitStruct.Pin = GPIO_PIN_5; 
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP; 
    GPIO_InitStruct.Pull = GPIO_NOPULL; 
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW; 
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct); 
 
    // 2. USART Pins 
    // PA2 (TX) and PA3 (RX) for USART2 Debug 
    // PA9 (TX) and PA10 (RX) for USART1 HC-12 
    GPIO_InitStruct.Pin = GPIO_PIN_2|GPIO_PIN_3|GPIO_PIN_9|GPIO_PIN_10; 
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP; 
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH; 
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct); 
 
    // 3. Traffic Light Pins (PB0-PB11) 
    GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3 
                        |GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7 
                        |GPIO_PIN_8|GPIO_PIN_9|GPIO_PIN_10|GPIO_PIN_11; 
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP; 
    GPIO_InitStruct.Pull = GPIO_NOPULL; 
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW; 
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct); 
                    
 
    // Start all lights in the RED state for safety 
    AllRed(); 
} 
 
/* USER CODE BEGIN 4 */ 
 
/* UART Rx complete callback: called by HAL from IRQ context */ 
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) 
{ 
    // Confirm the interrupt originated from the HC-12 UART instance (USART1) 
    if (huart->Instance == USART1) 
    { 
        uint8_t received_byte = RxData; 
 
        // --- State Machine for Packet Assembly --- 
        if (received_byte == START_DELIMITER) { 
            RxIndex = 0; 
            ReceivingPacket = true; 
            RxPacketBuffer[RxIndex++] = received_byte; 
        } 
        else if (ReceivingPacket) { 
 
            if (RxIndex < PACKET_SIZE) { 
                RxPacketBuffer[RxIndex++] = received_byte; 
 
                if (received_byte == STOP_DELIMITER) { 
                    // Packet complete! Attempt processing. 
                    Process_Emergency_Packet(RxPacketBuffer); 
 
                    RxIndex = 0; 
                    ReceivingPacket = false; 
                } 
            } 
            else { 
                // Buffer overflow (packet too long). Abort. 
                ReceivingPacket = false; 
                RxIndex = 0; 
                HAL_UART_Transmit(&huart2, (uint8_t*)"[ERROR] Buffer Overflow. Resetting.\r\n", 36, 10); 
            } 
        } 
 
        // CRITICAL STEP: Re-arm the receiver for the next byte on USART1 
        HAL_UART_Receive_IT(&huart1, (uint8_t*)&RxData, 1); 
    } 
} 
 
/* Optional: UART error callback to recover on errors */ 
                    
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart) 
{ 
    if (huart->Instance == USART1) 
    { 
        if (huart->ErrorCode & (HAL_UART_ERROR_ORE | HAL_UART_ERROR_FE | HAL_UART_ERROR_NE)) 
        { 
            __HAL_UART_CLEAR_FLAG(huart, UART_FLAG_ORE | UART_FLAG_FE | UART_FLAG_NE); 
            huart->RxState = HAL_UART_STATE_READY; 
            HAL_UART_Receive_IT(&huart1, (uint8_t*)&RxData, 1); 
        } 
    } 
} 
/* USER CODE END 4 */ 
 
/** 
  * @brief  This function is executed in case of error occurrence. 
  * @retval None 
  */ 
void Error_Handler(void) 
{ 
    /* USER CODE BEGIN Error_Handler_Debug */ 
    __disable_irq(); 
    while (1) 
    { 
        HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5); 
        HAL_Delay(50); 
    } 
    /* USER CODE END Error_Handler_Debug */ 
} 
 
#ifdef  USE_FULL_ASSERT 
void assert_failed(uint8_t *file, uint32_t line) 
{ 
} 
#endif /* USE_FULL_ASSERT */ 